//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Neprávne používateľské meno alebo heslo";
"_cancelled_by_user"                    = "Prenos zrušený";
"_error_folder_destiny_is_the_same_"    = "Nie je možné presunúť priečinok do samého seba";
"_error_not_permission_"                = "Na dokončenie tejto operácie nemáte oprávnenie";
"_error_path_"                          = "Tento súbor alebo zložku nie je možné otvoriť. Skontrolujte, či existuje";
"_file_upload_not_exitst_"              = "Súbor, ktorý chcete nahrať neexistuje";
"_forbidden_characters_from_server_"    = "Meno obsahuje nepovolené znaky.";
"_not_connected_internet_"              = "Chyba pripojenia k serveru";
"_not_possible_connect_to_server_"      = "Nie je možné sa v tomto momente pripojiť k serveru";
"_not_possible_create_folder_"          = "Nie je možné vytvoriť priečinok";
"_server_down_"                         = "Nepodarilo sa nadviazať spojenie so serverom";
"_time_out_"                            = "Čas spojenia vypršal, skúste znovu";
"_unknow_response_server_"              = "Neočakávaná odpoveď servera";
"_user_autentication_required_"         = "Vyžaduje sa overenie používateľa";
"_file_directory_locked_"               = "Súbor alebo adresár je zamknutý";
"_ssl_certificate_untrusted_"           = "Certifikát tohto servera je neplatný";
"_internal_server_"                     = "Vnútorná chyba servera";
"_file_already_exists_"                 = "Nepodarilo sa dokončiť operáciu, súbor s rovnakým menom už existuje";
"_file_folder_not_exists_"              = "Zdrojový súbor sa v danej ceste nenachádza";
"_folder_contents_nochanged_"           = "Obsah zložky sa nezmenil";
"_images_invalid_converted_"            = "Obrázok je neplatný a nie je možné ho konvertovať do náhľadu";
"_method_not_expected_"                 = "Neočakávaná metóda požiadavky";
"_reauthenticate_user_"                 = "Prístup vypršal, prihláste sa znovu";
"_server_error_retry_"                  = "Server je dočasne nedostupný";
"_too_many_files_"                      = "Do tejto operácie bude zapojených príliš veľa súborov";
"_too_many_request_"                    = "Odoslanie veľkého počtu požiadaviek spôsobilo dosiahnutie hranice miery obmedzenia.";
"_user_over_quota_"                     = "Bola dosiahnutá kapacita úložiska";
"_ssl_connection_error_"                = "Chyba v SSL spojení, skúste znovu";
"_bad_request_"                         = "Neplatná požiadavka";
"_webdav_locked_"                       = "WebDAV uzamknutý: Zdroj, ku ktorému sa pristupuje, je uzamknutý";
"_error_user_not_available_"            = "Používateľ už nie je k dispozícii";
"_server_response_error_"               = "Chyba odpovede zo servera";


